from datetime import *


def clock(num):
    minutes = {"01": "одна", "02": "две", "03": "три", "04": "четыре", "05": "пять", "06": "шесть", "07": "семь",
               "08": "восемь", "09": "девять", "10": "десять", "11": "одиннадцать", "12": "двенадцать",
               "13": "тринадцать", "14": "четырнадцать", "15": "пятнадцать", "16": "шестнадцать", "17": "семнадцать",
               "18": "восемнадцать", "19": "девятнадцать", "20": "двадцать",
               "21": "двадцать одна", "22": "двадцать две", "23": "двадцать три", "24": "двадцать четыре",
               "25": "двадцать пять", "26": "двадцать шесть", "27": "двадцать семь", "28": "двадцать восемь",
               "29": "двадцать девять", "30": "тридцать", "31": "тридцать одна", "32": "тридцать две",
               "33": "тридцать три", "34": "тридцать четыре", "35": "тридцать пять", "36": "тридцать шесть",
               "37": "тридцать семь", "38": "тридцать восемь", "39": "тридцать девять", "1": "одна", "2": "две",
               "3": "три", "4": "четыре", "5": "пять", "6": "шесть", "7": "семь",
               "8": "восемь", "9": "девять"}

    hours = {"0": "ноль", "1": "час", "2": "два", "3": "три", "4": "четыре", "5": "пять", "6": "шесть", "7": "семь",
             "8": "восемь", "9": "девять", "10": "десять", "11": "одиннадцать", "12": "двенадцать"}

    letter_min_ = ["минута", "минуты", "минут"]
    letter_hour_ = ["часов", "час", "часа"]
    # num = input("Введите время с консоли в формате # or ## or ### or #### ")
    num = int(num)
    a = num // 100  # a:00-часы
    c = num % 100  # 00:c-минуты
    b = time(a, c).strftime("%H:%M")
    time_list = b.strip().split(":")
    hour = ""
    # ______________________________________________________________________________________________________
    if c == 0:
        letter_hour = ""
        minu = "ровно"
        # hour = ""
        if a <= 12:
            hour = hours[str(int(time_list[0]))]
        elif a >= 12:
            hour = hours[str((int(time_list[0])) - 12)]
        if a == 1 or a == 13:
            hour = "один"
            letter_hour = letter_hour_[1]
        elif a in [0, 5, 6, 7, 8, 9, 10, 11, 12, 17, 18, 19, 20, 21, 22, 23]:
            letter_hour = letter_hour_[0]         # обзываем словами часы
        elif a in [2, 3, 4, 14, 15, 16, 18]:
            letter_hour = letter_hour_[2]
        return b, hour, letter_hour, minu
    # ______________________________________________________________________________________________________
    elif c in range(1, 30) or c in range(31, 40):
        # hour = ""
        letter_min = ""
        minu = minutes[time_list[1]]
        if minu in ["одна", "двадцать одна", "тридцать одна"]:
            letter_min = letter_min + letter_min_[0]    # обзываем словами минуты
        elif minu in ["две", "три", "четыре", "двадцать две", "двадцать три", "двадцать четыре", "тридцать две",
                      "тридцать три", "тридцать четыре"]:
            letter_min = letter_min_[1]
        else:
            letter_min = letter_min_[2]
        if a == 0 or a == 12:
            hour = hour + "первого"
        elif a == 1 or a == 13:
            hour = hour + "второго"
        elif a == 2 or a == 14:
            hour = hour + "третьего"
        elif a == 3 or a == 15:
            hour = hour + "четвертого"
        elif a == 6 or a == 18:
            hour = hour + "седьмого"
        elif a == 7 or a == 19:
            hour = hour + "восьмого"
        elif a > 15:
            hour_ = hours[str(a - 12 + 1)]
            hour = hour + (hour_[:len(hour_) - 1] + "ого")    # просклонял слова
        else:
            hour_ = hours[str(a + 1)]
            hour = hour + (hour_[:len(hour_) - 1] + "ого")
        return b, minu, letter_min, hour
    # ______________________________________________________________________________________________________
    elif c == 30:
        minu = "Половина"
        # hour = ""
        if a in [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 18, 19]:
            if a == 0 or a == 12:
                hour = hour + "первого"
            elif a == 1 or a == 13:
                hour = hour + "второго"
            elif a == 2 or a == 14:
                hour = hour + "третьего"
            elif a == 3 or a == 15:
                hour = hour + "четвертого"
            elif a == 6 or a == 18:
                hour = hour + "седьмого"
            elif a == 7 or a == 19:
                hour = hour + "восьмого"
            else:
                hour_ = hours[str(a + 1)]
                hour = hour + (hour_[:len(hour_) - 1] + "ого")
        elif a > 15:
            hour_ = hours[str(a - 12 + 1)]
            hour = hour + (hour_[:len(hour_) - 1] + "ого")

        return b, minu, hour
    # ______________________________________________________________________________________________________
    elif c >= 40:
        minu = ""
        # hour = ""
        if 60 - c == 8:
            minu = minu + "восьми"
        elif 60 - c == 4:
            minu = minu + "четырех"
        elif 60 - c == 3:
            minu = minu + "трех"
        elif 60 - c == 2:
            minu = minu + "двух"
        elif 60 - c == 1:
            minu = minu + "одной"
        else:
            min_ = minutes[str(60 - int(time_list[1]))]
            minu = minu + (min_[:len(min_) - 1] + "и")
        if a < 12:
            hour = hour + hours[str(1 + (int(time_list[0])))]
        elif a >= 12:
            hour = hour + hours[str((int(time_list[0])) - 12 + 1)]
        return b, "Без", minu, hour


# ______________________________________________________________________________________________________
tc = input("Введите время в формате 24 часа #### (например:2359)")
print("Time entered from console: ", *clock(tc))
cur_time = datetime.now().strftime("%H%M")
print("Current time: ", *clock(cur_time))
