from datetime import *

num = input("Введите время с консоли в формате # or ## or ### or #### ")

cur_time = datetime.now().strftime("%H:%M")

hour = {"00": "ноль чаcов", "01": "один час", "02": "два часа", "03": "три часа", "04": "четыре часа",
        "05": "пять часов",
        "06": "шесть часов", "07": "семь часов", "08": "восемь часов", "09": "девять часов", "10": "десять часов",
        "11": "одинадцать часов", "12": "двенадцать часов", "13": "тринадцать часов", "14": "четырнадцать часов",
        "15": "пятнадцать часов", "16": "шестнадцать часов", "17": "семнадцать часов ", "18": "восемнадцать часов ",
        "19": "девятнадцать часов", "20": "двадцать часов", "21": "двадцать один час", "22": "двадцать два часа",
        "23": "двадцать три часа", "24": "двадцать четыре часа"}

minutes = {"00": "ноль минут", "01": "одна минута", "02": "две минуты", "03": "три минуты", "04": "четыре минуты",
           "05": "пять минут", "06": "шесть минут", "07": "семь минут", "08": "восемь минут", "09": "девять минут",
           "10": "десять минут", "11": "одинадцать чминут", "12": "двенадцать минут", "13": "тринадцать минут",
           "14": "четырнадцать минут", "15": "пятнадцать минут", "16": "шестнадцать минут", "17": "семнадцать минут",
           "18": "восемнадцать минут ", "19": "девятнадцать минут", "20": "двадцать минут", "21": "двадцать одна минута",
           "22": "двадцать две минуты", "23": "двадцать три минуты", "24": "двадцать четыре минуты",
           "25": "двадцать пять минут", "26": "двадцать шесть минут", "27": "двадцать семь минут",
           "28": "двадцать восемь минут", "29": "двадцать девять минут", "30": "тридцать минут",
           "31": "тридцать одна минута", "32": "тридцать две минуты", "33": "тридцать три минуты",
           "34": "тридцать четыре минуты", "35": "тридцать пять минут", "36": "тридцать шесть минут",
           "37": "тридцать семь минут", "38": "тридцать восемь минут", "39": "тридцать девять минут",
           "40": "сорок минут", "41": "сорок одна минута", "42": "сорок две минуты", "43": "сорок три минуты",
           "44": "сорок четыре минуты", "45": "сорок пять минут", "46": "сорок шесть минут", "47": "сорок семь минут",
           "48": "сорок восемь минут", "49": "сорок девять минут", "50": "пятьдесят минут",
           "51": "пятьдесят одна минута", "52": "пятьдесят две минуты", "53": "пятьдесят три минуты",
           "54": "пятьдесят четыре минуты", "55": "пятьдесят пять минут", "56": "пятьдесят шесть минут",
           "57": "пятьдесят семь минут", "58": "пятьдесят восемь минут", "59": "пятьдесят девять минут"}
# --------------------Current time----------------------------------------------------------#
time_list = cur_time.strip().split(":")
h = time_list[0]
m = time_list[1]
print("Current time: ", cur_time, hour[h], minutes[m])
# ---------------------Time Console---------------------------------------------------------#
if len(num) == 1 or len(num) == 2:
    num = int(num)
    if num < 24:
        b = time(num).strftime("%H:%M")
        time_list = b.strip().split(":")
        h = time_list[0]
        m = time_list[1]
        print("Time entered from console: ", b, hour[h], minutes[m])
    else:
        print("The time entered from the console is not correct. Range 0 ... 23 at you ", num)
# ..........................................................................................#
elif len(num) == 3:
    num = int(num)
    if num // 10 < 24:
        if num % 10 < 6:
            a = num // 10
            c = (num % 10) * 10
            b = time(a, c).strftime("%H:%M")
            time_list = b.strip().split(":")
            h = time_list[0]
            m = time_list[1]
            print("Time entered from console: ", b, hour[h], minutes[m])
        else:
            print("The time entered from the console is not correct. Range **X 0 ... 5 at you ", "**" + str(num % 10))
    else:
        print("The time entered from the console is not correct. Range XX* 0 ... 23 at you ", str(num // 10) + "*")
# ............................................................................................#
elif len(num) == 4:
    num = int(num)
    if num // 100 < 24:
        if num % 100 < 60:
            a = num // 100
            c = num % 100
            b = time(a, c).strftime("%H:%M")
            time_list = b.strip().split(":")
            h = time_list[0]
            m = time_list[1]
            print("Time entered from console: ", b, hour[h], minutes[m])
        else:
            print("The time entered from the console is not correct. Range **XX 0 ... 59 at you ",
                  "**" + str(num % 100))
    else:
        print("The time entered from the console is not correct. Range XX** 0 ... 23 at you ", str(num // 100) + "**")
